espressif/esp-idf/components/soc/esp32c6/register/soc/extmem_reg.h
/**
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

#define EXTMEM_L1_CACHE_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x4)
/* EXTMEM_L1_CACHE_SHUT_DBUS : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: The bit is used to disable core0 dbus access L1-Cache, 0: enable, 1: disable.*/
#define EXTMEM_L1_CACHE_SHUT_DBUS    (BIT(1))
#define EXTMEM_L1_CACHE_SHUT_DBUS_M  (BIT(1))
#define EXTMEM_L1_CACHE_SHUT_DBUS_V  0x1
#define EXTMEM_L1_CACHE_SHUT_DBUS_S  1
/* EXTMEM_L1_CACHE_SHUT_IBUS : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: The bit is used to disable core0 dbus access L1-Cache, 0: enable, 1: disable.*/
#define EXTMEM_L1_CACHE_SHUT_IBUS    (BIT(0))
#define EXTMEM_L1_CACHE_SHUT_IBUS_M  (BIT(0))
#define EXTMEM_L1_CACHE_SHUT_IBUS_V  0x1
#define EXTMEM_L1_CACHE_SHUT_IBUS_S  0
/* EXTMEM_L1_CACHE_UNDEF_OP : R/W ;bitpos:[11:8] ;default: 4'h0 ; */
/*description: Internal debug control field. bits[1:0]: Arbitration mode. 0: Round-robin, hold bus
 until data fetch completes. 1: Round-robin, release bus after request is issued. 2/3: Random
 arbitration..*/
#define EXTMEM_L1_CACHE_UNDEF_OP    0x0000000F
#define EXTMEM_L1_CACHE_UNDEF_OP_M  ((EXTMEM_L1_CACHE_UNDEF_OP_V)<<(EXTMEM_L1_CACHE_UNDEF_OP_S))
#define EXTMEM_L1_CACHE_UNDEF_OP_V  0xF
#define EXTMEM_L1_CACHE_UNDEF_OP_S  8

#define EXTMEM_L1_CACHE_WRAP_AROUND_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x20)
/* EXTMEM_L1_CACHE_WRAP : R/W ;bitpos:[4] ;default: 1'h0 ; */
/*description: Set this bit as 1 to enable L1-DCache wrap around mode..*/
#define EXTMEM_L1_CACHE_WRAP    (BIT(4))
#define EXTMEM_L1_CACHE_WRAP_M  (BIT(4))
#define EXTMEM_L1_CACHE_WRAP_V  0x1
#define EXTMEM_L1_CACHE_WRAP_S  4

#define EXTMEM_L1_CACHE_TAG_MEM_POWER_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x24)
/* EXTMEM_L1_CACHE_TAG_MEM_FORCE_PU : R/W ;bitpos:[18] ;default: 1'h1 ; */
/*description: The bit is used to power L1-Cache tag memory up. 0: follow rtc_lslp, 1: power up.*/
#define EXTMEM_L1_CACHE_TAG_MEM_FORCE_PU    (BIT(18))
#define EXTMEM_L1_CACHE_TAG_MEM_FORCE_PU_M  (BIT(18))
#define EXTMEM_L1_CACHE_TAG_MEM_FORCE_PU_V  0x1
#define EXTMEM_L1_CACHE_TAG_MEM_FORCE_PU_S  18
/* EXTMEM_L1_CACHE_TAG_MEM_FORCE_PD : R/W ;bitpos:[17] ;default: 1'h0 ; */
/*description: The bit is used to power L1-Cache tag memory down. 0: follow rtc_lslp, 1: power
down.*/
#define EXTMEM_L1_CACHE_TAG_MEM_FORCE_PD    (BIT(17))
#define EXTMEM_L1_CACHE_TAG_MEM_FORCE_PD_M  (BIT(17))
#define EXTMEM_L1_CACHE_TAG_MEM_FORCE_PD_V  0x1
#define EXTMEM_L1_CACHE_TAG_MEM_FORCE_PD_S  17
/* EXTMEM_L1_CACHE_TAG_MEM_FORCE_ON : R/W ;bitpos:[16] ;default: 1'h1 ; */
/*description: The bit is used to close clock gating of  L1-Cache tag memory. 1: close gating,
0: open clock gating..*/
#define EXTMEM_L1_CACHE_TAG_MEM_FORCE_ON    (BIT(16))
#define EXTMEM_L1_CACHE_TAG_MEM_FORCE_ON_M  (BIT(16))
#define EXTMEM_L1_CACHE_TAG_MEM_FORCE_ON_V  0x1
#define EXTMEM_L1_CACHE_TAG_MEM_FORCE_ON_S  16

#define EXTMEM_L1_CACHE_DATA_MEM_POWER_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x28)
/* EXTMEM_L1_CACHE_DATA_MEM_FORCE_PU : R/W ;bitpos:[18] ;default: 1'h1 ; */
/*description: The bit is used to power L1-Cache data memory up. 0: follow rtc_lslp, 1: power u
p.*/
#define EXTMEM_L1_CACHE_DATA_MEM_FORCE_PU    (BIT(18))
#define EXTMEM_L1_CACHE_DATA_MEM_FORCE_PU_M  (BIT(18))
#define EXTMEM_L1_CACHE_DATA_MEM_FORCE_PU_V  0x1
#define EXTMEM_L1_CACHE_DATA_MEM_FORCE_PU_S  18
/* EXTMEM_L1_CACHE_DATA_MEM_FORCE_PD : R/W ;bitpos:[17] ;default: 1'h0 ; */
/*description: The bit is used to power L1-Cache data memory down. 0: follow rtc_lslp, 1: power
 down.*/
#define EXTMEM_L1_CACHE_DATA_MEM_FORCE_PD    (BIT(17))
#define EXTMEM_L1_CACHE_DATA_MEM_FORCE_PD_M  (BIT(17))
#define EXTMEM_L1_CACHE_DATA_MEM_FORCE_PD_V  0x1
#define EXTMEM_L1_CACHE_DATA_MEM_FORCE_PD_S  17
/* EXTMEM_L1_CACHE_DATA_MEM_FORCE_ON : R/W ;bitpos:[16] ;default: 1'h1 ; */
/*description: The bit is used to close clock gating of  L1-Cache data memory. 1: close gating,
 0: open clock gating..*/
#define EXTMEM_L1_CACHE_DATA_MEM_FORCE_ON    (BIT(16))
#define EXTMEM_L1_CACHE_DATA_MEM_FORCE_ON_M  (BIT(16))
#define EXTMEM_L1_CACHE_DATA_MEM_FORCE_ON_V  0x1
#define EXTMEM_L1_CACHE_DATA_MEM_FORCE_ON_S  16

#define EXTMEM_L1_CACHE_FREEZE_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x2C)
/* EXTMEM_L1_CACHE_FREEZE_DONE : RO ;bitpos:[18] ;default: 1'h0 ; */
/*description: The bit is used to indicate whether freeze operation on L1-Cache is finished or
not. 0: not finished. 1: finished..*/
#define EXTMEM_L1_CACHE_FREEZE_DONE    (BIT(18))
#define EXTMEM_L1_CACHE_FREEZE_DONE_M  (BIT(18))
#define EXTMEM_L1_CACHE_FREEZE_DONE_V  0x1
#define EXTMEM_L1_CACHE_FREEZE_DONE_S  18
/* EXTMEM_L1_CACHE_FREEZE_MODE : R/W ;bitpos:[17] ;default: 1'h0 ; */
/*description: The bit is used to configure mode of freeze operation L1-Cache. 0: a miss-access
 will not stuck. 1: a miss-access will stuck..*/
#define EXTMEM_L1_CACHE_FREEZE_MODE    (BIT(17))
#define EXTMEM_L1_CACHE_FREEZE_MODE_M  (BIT(17))
#define EXTMEM_L1_CACHE_FREEZE_MODE_V  0x1
#define EXTMEM_L1_CACHE_FREEZE_MODE_S  17
/* EXTMEM_L1_CACHE_FREEZE_EN : R/W ;bitpos:[16] ;default: 1'h0 ; */
/*description: The bit is used to enable freeze operation on L1-Cache. It can be cleared by sof
tware..*/
#define EXTMEM_L1_CACHE_FREEZE_EN    (BIT(16))
#define EXTMEM_L1_CACHE_FREEZE_EN_M  (BIT(16))
#define EXTMEM_L1_CACHE_FREEZE_EN_V  0x1
#define EXTMEM_L1_CACHE_FREEZE_EN_S  16

#define EXTMEM_L1_CACHE_DATA_MEM_ACS_CONF_REG          (DR_REG_EXTMEM_BASE + 0x30)
/* EXTMEM_L1_CACHE_DATA_MEM_WR_EN : R/W ;bitpos:[17] ;default: 1'h1 ; */
/*description: The bit is used to enable config-bus write L1-Cache data memoryory. 0: disable,
1: enable..*/
#define EXTMEM_L1_CACHE_DATA_MEM_WR_EN    (BIT(17))
#define EXTMEM_L1_CACHE_DATA_MEM_WR_EN_M  (BIT(17))
#define EXTMEM_L1_CACHE_DATA_MEM_WR_EN_V  0x1
#define EXTMEM_L1_CACHE_DATA_MEM_WR_EN_S  17
/* EXTMEM_L1_CACHE_DATA_MEM_RD_EN : R/W ;bitpos:[16] ;default: 1'h1 ; */
/*description: The bit is used to enable config-bus read L1-Cache data memoryory. 0: disable, 1
: enable..*/
#define EXTMEM_L1_CACHE_DATA_MEM_RD_EN    (BIT(16))
#define EXTMEM_L1_CACHE_DATA_MEM_RD_EN_M  (BIT(16))
#define EXTMEM_L1_CACHE_DATA_MEM_RD_EN_V  0x1
#define EXTMEM_L1_CACHE_DATA_MEM_RD_EN_S  16

#define EXTMEM_L1_CACHE_TAG_MEM_ACS_CONF_REG          (DR_REG_EXTMEM_BASE + 0x34)
/* EXTMEM_L1_CACHE_TAG_MEM_WR_EN : R/W ;bitpos:[17] ;default: 1'h1 ; */
/*description: The bit is used to enable config-bus write L1-Cache tag memoryory. 0: disable, 1
: enable..*/
#define EXTMEM_L1_CACHE_TAG_MEM_WR_EN    (BIT(17))
#define EXTMEM_L1_CACHE_TAG_MEM_WR_EN_M  (BIT(17))
#define EXTMEM_L1_CACHE_TAG_MEM_WR_EN_V  0x1
#define EXTMEM_L1_CACHE_TAG_MEM_WR_EN_S  17
/* EXTMEM_L1_CACHE_TAG_MEM_RD_EN : R/W ;bitpos:[16] ;default: 1'h1 ; */
/*description: The bit is used to enable config-bus read L1-Cache tag memoryory. 0: disable, 1:
 enable..*/
#define EXTMEM_L1_CACHE_TAG_MEM_RD_EN    (BIT(16))
#define EXTMEM_L1_CACHE_TAG_MEM_RD_EN_M  (BIT(16))
#define EXTMEM_L1_CACHE_TAG_MEM_RD_EN_V  0x1
#define EXTMEM_L1_CACHE_TAG_MEM_RD_EN_S  16

#define EXTMEM_L1_CACHE_PRELOCK_CONF_REG          (DR_REG_EXTMEM_BASE + 0x78)
/* EXTMEM_L1_CACHE_PRELOCK_SCT1_EN : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: The bit is used to enable the second section of prelock function on L1-Cache..*/
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_EN    (BIT(1))
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_EN_M  (BIT(1))
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_EN_V  0x1
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_EN_S  1
/* EXTMEM_L1_CACHE_PRELOCK_SCT0_EN : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: The bit is used to enable the first section of prelock function on L1-Cache..*/
#define EXTMEM_L1_CACHE_PRELOCK_SCT0_EN    (BIT(0))
#define EXTMEM_L1_CACHE_PRELOCK_SCT0_EN_M  (BIT(0))
#define EXTMEM_L1_CACHE_PRELOCK_SCT0_EN_V  0x1
#define EXTMEM_L1_CACHE_PRELOCK_SCT0_EN_S  0

#define EXTMEM_L1_CACHE_PRELOCK_SCT0_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x7C)
/* EXTMEM_L1_CACHE_PRELOCK_SCT0_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the first section
of prelock on L1-Cache, which should be used together with L1_CACHE_PRELOCK_SCT0
_SIZE_REG.*/
#define EXTMEM_L1_CACHE_PRELOCK_SCT0_ADDR    0xFFFFFFFF
#define EXTMEM_L1_CACHE_PRELOCK_SCT0_ADDR_M  ((EXTMEM_L1_CACHE_PRELOCK_SCT0_ADDR_V)<<(EXTMEM_L1_CACHE_PRELOCK_SCT0_ADDR_S))
#define EXTMEM_L1_CACHE_PRELOCK_SCT0_ADDR_V  0xFFFFFFFF
#define EXTMEM_L1_CACHE_PRELOCK_SCT0_ADDR_S  0

