espressif/esp-idf/components/soc/esp32c6/register/soc/extmem_reg.h
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x80)
/* EXTMEM_L1_CACHE_PRELOCK_SCT1_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the second section
 of prelock on L1-Cache, which should be used together with L1_CACHE_PRELOCK_SCT
1_SIZE_REG.*/
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_ADDR    0xFFFFFFFF
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_ADDR_M  ((EXTMEM_L1_CACHE_PRELOCK_SCT1_ADDR_V)<<(EXTMEM_L1_CACHE_PRELOCK_SCT1_ADDR_S))
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_ADDR_V  0xFFFFFFFF
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_ADDR_S  0

#define EXTMEM_L1_CACHE_PRELOCK_SCT_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x84)
/* EXTMEM_L1_CACHE_PRELOCK_SCT1_SIZE : R/W ;bitpos:[29:16] ;default: 14'h3fff ; */
/*description: Those bits are used to configure the size of the second section of prelock on L1
-Cache, which should be used together with L1_CACHE_PRELOCK_SCT1_ADDR_REG.*/
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_SIZE    0x00003FFF
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_SIZE_M  ((EXTMEM_L1_CACHE_PRELOCK_SCT1_SIZE_V)<<(EXTMEM_L1_CACHE_PRELOCK_SCT1_SIZE_S))
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_SIZE_V  0x3FFF
#define EXTMEM_L1_CACHE_PRELOCK_SCT1_SIZE_S  16
/* EXTMEM_L1_CACHE_PRELOCK_SCT0_SIZE : R/W ;bitpos:[13:0] ;default: 14'h3fff ; */
/*description: Those bits are used to configure the size of the first section of prelock on L1-
Cache, which should be used together with L1_CACHE_PRELOCK_SCT0_ADDR_REG.*/
#define EXTMEM_L1_CACHE_PRELOCK_SCT0_SIZE    0x00003FFF
#define EXTMEM_L1_CACHE_PRELOCK_SCT0_SIZE_M  ((EXTMEM_L1_CACHE_PRELOCK_SCT0_SIZE_V)<<(EXTMEM_L1_CACHE_PRELOCK_SCT0_SIZE_S))
#define EXTMEM_L1_CACHE_PRELOCK_SCT0_SIZE_V  0x3FFF
#define EXTMEM_L1_CACHE_PRELOCK_SCT0_SIZE_S  0

#define EXTMEM_L1_CACHE_LOCK_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x88)
/* EXTMEM_L1_CACHE_LOCK_DONE : RO ;bitpos:[2] ;default: 1'h1 ; */
/*description: The bit is used to indicate whether unlock/lock operation is finished or not. 0:
 not finished. 1: finished..*/
#define EXTMEM_L1_CACHE_LOCK_DONE    (BIT(2))
#define EXTMEM_L1_CACHE_LOCK_DONE_M  (BIT(2))
#define EXTMEM_L1_CACHE_LOCK_DONE_V  0x1
#define EXTMEM_L1_CACHE_LOCK_DONE_S  2
/* EXTMEM_L1_CACHE_UNLOCK_ENA : R/W/SC ;bitpos:[1] ;default: 1'h0 ; */
/*description: The bit is used to enable unlock operation. It will be cleared by hardware after
 unlock operation done.*/
#define EXTMEM_L1_CACHE_UNLOCK_ENA    (BIT(1))
#define EXTMEM_L1_CACHE_UNLOCK_ENA_M  (BIT(1))
#define EXTMEM_L1_CACHE_UNLOCK_ENA_V  0x1
#define EXTMEM_L1_CACHE_UNLOCK_ENA_S  1
/* EXTMEM_L1_CACHE_LOCK_ENA : R/W/SC ;bitpos:[0] ;default: 1'h0 ; */
/*description: The bit is used to enable lock operation. It will be cleared by hardware after l
ock operation done.*/
#define EXTMEM_L1_CACHE_LOCK_ENA    (BIT(0))
#define EXTMEM_L1_CACHE_LOCK_ENA_M  (BIT(0))
#define EXTMEM_L1_CACHE_LOCK_ENA_V  0x1
#define EXTMEM_L1_CACHE_LOCK_ENA_S  0

#define EXTMEM_L1_CACHE_LOCK_MAP_REG          (DR_REG_EXTMEM_BASE + 0x8C)
/* EXTMEM_L1_CACHE_LOCK_MAP : R/W ;bitpos:[5:0] ;default: 6'h0 ; */
/*description: Those bits are used to indicate which caches in the two-level cache structure wi
ll apply this lock/unlock operation. [4]: L1-Cache.*/
#define EXTMEM_L1_CACHE_LOCK_MAP    0x0000003F
#define EXTMEM_L1_CACHE_LOCK_MAP_M  ((EXTMEM_L1_CACHE_LOCK_MAP_V)<<(EXTMEM_L1_CACHE_LOCK_MAP_S))
#define EXTMEM_L1_CACHE_LOCK_MAP_V  0x3F
#define EXTMEM_L1_CACHE_LOCK_MAP_S  0

#define EXTMEM_L1_CACHE_LOCK_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x90)
/* EXTMEM_L1_CACHE_LOCK_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the lock/unlock op
eration, which should be used together with CACHE_LOCK_SIZE_REG.*/
#define EXTMEM_L1_CACHE_LOCK_ADDR    0xFFFFFFFF
#define EXTMEM_L1_CACHE_LOCK_ADDR_M  ((EXTMEM_L1_CACHE_LOCK_ADDR_V)<<(EXTMEM_L1_CACHE_LOCK_ADDR_S))
#define EXTMEM_L1_CACHE_LOCK_ADDR_V  0xFFFFFFFF
#define EXTMEM_L1_CACHE_LOCK_ADDR_S  0

#define EXTMEM_L1_CACHE_LOCK_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x94)
/* EXTMEM_L1_CACHE_LOCK_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: Those bits are used to configure the size of the lock/unlock operation, which sh
ould be used together with CACHE_LOCK_ADDR_REG.*/
#define EXTMEM_L1_CACHE_LOCK_SIZE    0x0000FFFF
#define EXTMEM_L1_CACHE_LOCK_SIZE_M  ((EXTMEM_L1_CACHE_LOCK_SIZE_V)<<(EXTMEM_L1_CACHE_LOCK_SIZE_S))
#define EXTMEM_L1_CACHE_LOCK_SIZE_V  0xFFFF
#define EXTMEM_L1_CACHE_LOCK_SIZE_S  0

#define EXTMEM_L1_CACHE_SYNC_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x98)
/* EXTMEM_L1_CACHE_SYNC_DONE : RO ;bitpos:[4] ;default: 1'h0 ; */
/*description: The bit is used to indicate whether sync operation (invalidate, clean, writeback
, writeback_invalidate) is finished or not. 0: not finished. 1: finished..*/
#define EXTMEM_L1_CACHE_SYNC_DONE    (BIT(4))
#define EXTMEM_L1_CACHE_SYNC_DONE_M  (BIT(4))
#define EXTMEM_L1_CACHE_SYNC_DONE_V  0x1
#define EXTMEM_L1_CACHE_SYNC_DONE_S  4
/* EXTMEM_L1_CACHE_WRITEBACK_INVALIDATE_ENA : R/W/SC ;bitpos:[3] ;default: 1'h0 ; */
/*description: The bit is used to enable writeback-invalidate operation. It will be cleared by
hardware after writeback-invalidate operation done. Note that this bit and the
other sync-bits (invalidate_ena, clean_ena, writeback_ena) are mutually exclusive
, that is, those bits can not be set to 1 at the same time..*/
#define EXTMEM_L1_CACHE_WRITEBACK_INVALIDATE_ENA    (BIT(3))
#define EXTMEM_L1_CACHE_WRITEBACK_INVALIDATE_ENA_M  (BIT(3))
#define EXTMEM_L1_CACHE_WRITEBACK_INVALIDATE_ENA_V  0x1
#define EXTMEM_L1_CACHE_WRITEBACK_INVALIDATE_ENA_S  3
/* EXTMEM_L1_CACHE_WRITEBACK_ENA : R/W/SC ;bitpos:[2] ;default: 1'h0 ; */
/*description: The bit is used to enable writeback operation. It will be cleared by hardware af
ter writeback operation done. Note that this bit and the other sync-bits (invali
date_ena, clean_ena, writeback_invalidate_ena) are mutually exclusive, that is,
those bits can not be set to 1 at the same time..*/
#define EXTMEM_L1_CACHE_WRITEBACK_ENA    (BIT(2))
#define EXTMEM_L1_CACHE_WRITEBACK_ENA_M  (BIT(2))
#define EXTMEM_L1_CACHE_WRITEBACK_ENA_V  0x1
#define EXTMEM_L1_CACHE_WRITEBACK_ENA_S  2
/* EXTMEM_L1_CACHE_CLEAN_ENA : R/W/SC ;bitpos:[1] ;default: 1'h0 ; */
/*description: The bit is used to enable clean operation. It will be cleared by hardware after
clean operation done. Note that this bit and the other sync-bits (invalidate_ena
, writeback_ena, writeback_invalidate_ena) are mutually exclusive, that is, those
bits can not be set to 1 at the same time..*/
#define EXTMEM_L1_CACHE_CLEAN_ENA    (BIT(1))
#define EXTMEM_L1_CACHE_CLEAN_ENA_M  (BIT(1))
#define EXTMEM_L1_CACHE_CLEAN_ENA_V  0x1
#define EXTMEM_L1_CACHE_CLEAN_ENA_S  1
/* EXTMEM_L1_CACHE_INVALIDATE_ENA : R/W/SC ;bitpos:[0] ;default: 1'h1 ; */
/*description: The bit is used to enable invalidate operation. It will be cleared by hardware a
after invalidate operation done. Note that this bit and the other sync-bits (clean_ena,
writeback_ena, writeback_invalidate_ena) are mutually exclusive, that is,
 those bits can not be set to 1 at the same time..*/
#define EXTMEM_L1_CACHE_INVALIDATE_ENA    (BIT(0))
#define EXTMEM_L1_CACHE_INVALIDATE_ENA_M  (BIT(0))
#define EXTMEM_L1_CACHE_INVALIDATE_ENA_V  0x1
#define EXTMEM_L1_CACHE_INVALIDATE_ENA_S  0

#define EXTMEM_L1_CACHE_SYNC_MAP_REG          (DR_REG_EXTMEM_BASE + 0x9C)
/* EXTMEM_L1_CACHE_SYNC_MAP : R/W ;bitpos:[5:0] ;default: 6'h3f ; */
/*description: Those bits are used to indicate which caches in the two-level cache structure wi
ll apply the sync operation.  [4]: L1-Cache.*/
#define EXTMEM_L1_CACHE_SYNC_MAP    0x0000003F
#define EXTMEM_L1_CACHE_SYNC_MAP_M  ((EXTMEM_L1_CACHE_SYNC_MAP_V)<<(EXTMEM_L1_CACHE_SYNC_MAP_S))
#define EXTMEM_L1_CACHE_SYNC_MAP_V  0x3F
#define EXTMEM_L1_CACHE_SYNC_MAP_S  0

#define EXTMEM_L1_CACHE_SYNC_ADDR_REG          (DR_REG_EXTMEM_BASE + 0xA0)
/* EXTMEM_L1_CACHE_SYNC_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the sync operation
, which should be used together with CACHE_SYNC_SIZE_REG.*/
#define EXTMEM_L1_CACHE_SYNC_ADDR    0xFFFFFFFF
#define EXTMEM_L1_CACHE_SYNC_ADDR_M  ((EXTMEM_L1_CACHE_SYNC_ADDR_V)<<(EXTMEM_L1_CACHE_SYNC_ADDR_S))
#define EXTMEM_L1_CACHE_SYNC_ADDR_V  0xFFFFFFFF
#define EXTMEM_L1_CACHE_SYNC_ADDR_S  0

#define EXTMEM_L1_CACHE_SYNC_SIZE_REG          (DR_REG_EXTMEM_BASE + 0xA4)
/* EXTMEM_L1_CACHE_SYNC_SIZE : R/W ;bitpos:[23:0] ;default: 24'h0 ; */
/*description: Those bits are used to configure the size of the sync operation, which should be
 used together with CACHE_SYNC_ADDR_REG.*/
#define EXTMEM_L1_CACHE_SYNC_SIZE    0x00FFFFFF
#define EXTMEM_L1_CACHE_SYNC_SIZE_M  ((EXTMEM_L1_CACHE_SYNC_SIZE_V)<<(EXTMEM_L1_CACHE_SYNC_SIZE_S))
#define EXTMEM_L1_CACHE_SYNC_SIZE_V  0xFFFFFF
#define EXTMEM_L1_CACHE_SYNC_SIZE_S  0

#define EXTMEM_L1_CACHE_PRELOAD_CTRL_REG          (DR_REG_EXTMEM_BASE + 0xD8)
/* EXTMEM_L1_CACHE_PRELOAD_RGID : HRO ;bitpos:[6:3] ;default: 4'h0 ; */
/*description: The bit is used to set  the gid of l1 cache preload..*/
#define EXTMEM_L1_CACHE_PRELOAD_RGID    0x0000000F
#define EXTMEM_L1_CACHE_PRELOAD_RGID_M  ((EXTMEM_L1_CACHE_PRELOAD_RGID_V)<<(EXTMEM_L1_CACHE_PRELOAD_RGID_S))
#define EXTMEM_L1_CACHE_PRELOAD_RGID_V  0xF
#define EXTMEM_L1_CACHE_PRELOAD_RGID_S  3
/* EXTMEM_L1_CACHE_PRELOAD_ORDER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: The bit is used to configure the direction of preload operation. 0: ascending, 1
: descending..*/
#define EXTMEM_L1_CACHE_PRELOAD_ORDER    (BIT(2))
#define EXTMEM_L1_CACHE_PRELOAD_ORDER_M  (BIT(2))
#define EXTMEM_L1_CACHE_PRELOAD_ORDER_V  0x1
#define EXTMEM_L1_CACHE_PRELOAD_ORDER_S  2
/* EXTMEM_L1_CACHE_PRELOAD_DONE : RO ;bitpos:[1] ;default: 1'h1 ; */
/*description: The bit is used to indicate whether preload operation is finished or not. 0: not
 finished. 1: finished..*/
#define EXTMEM_L1_CACHE_PRELOAD_DONE    (BIT(1))
#define EXTMEM_L1_CACHE_PRELOAD_DONE_M  (BIT(1))
#define EXTMEM_L1_CACHE_PRELOAD_DONE_V  0x1
#define EXTMEM_L1_CACHE_PRELOAD_DONE_S  1
/* EXTMEM_L1_CACHE_PRELOAD_ENA : R/W/SC ;bitpos:[0] ;default: 1'h0 ; */
/*description: The bit is used to enable preload operation on L1-Cache. It will be cleared by h
ardware automatically after preload operation is done..*/
#define EXTMEM_L1_CACHE_PRELOAD_ENA    (BIT(0))
#define EXTMEM_L1_CACHE_PRELOAD_ENA_M  (BIT(0))
#define EXTMEM_L1_CACHE_PRELOAD_ENA_V  0x1
#define EXTMEM_L1_CACHE_PRELOAD_ENA_S  0

#define EXTMEM_L1_DCACHE_PRELOAD_ADDR_REG          (DR_REG_EXTMEM_BASE + 0xDC)
/* EXTMEM_L1_CACHE_PRELOAD_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of preload on L1-Cach
e, which should be used together with L1_CACHE_PRELOAD_SIZE_REG.*/
#define EXTMEM_L1_CACHE_PRELOAD_ADDR    0xFFFFFFFF
#define EXTMEM_L1_CACHE_PRELOAD_ADDR_M  ((EXTMEM_L1_CACHE_PRELOAD_ADDR_V)<<(EXTMEM_L1_CACHE_PRELOAD_ADDR_S))
#define EXTMEM_L1_CACHE_PRELOAD_ADDR_V  0xFFFFFFFF
#define EXTMEM_L1_CACHE_PRELOAD_ADDR_S  0

#define EXTMEM_L1_DCACHE_PRELOAD_SIZE_REG          (DR_REG_EXTMEM_BASE + 0xE0)
/* EXTMEM_L1_CACHE_PRELOAD_SIZE : R/W ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: Those bits are used to configure the size of the first section of prelock on L1-
Cache, which should be used together with L1_CACHE_PRELOAD_ADDR_REG.*/
#define EXTMEM_L1_CACHE_PRELOAD_SIZE    0x00003FFF
#define EXTMEM_L1_CACHE_PRELOAD_SIZE_M  ((EXTMEM_L1_CACHE_PRELOAD_SIZE_V)<<(EXTMEM_L1_CACHE_PRELOAD_SIZE_S))
#define EXTMEM_L1_CACHE_PRELOAD_SIZE_V  0x3FFF
#define EXTMEM_L1_CACHE_PRELOAD_SIZE_S  0

#define EXTMEM_L1_CACHE_AUTOLOAD_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x134)
/* EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ENA : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: The bit is used to enable the second section for autoload operation on L1-Cache..*/
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ENA    (BIT(9))
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ENA_M  (BIT(9))
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ENA_V  0x1
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ENA_S  9
/* EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ENA : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: The bit is used to enable the first section for autoload operation on L1-Cache..*/
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ENA    (BIT(8))
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ENA_M  (BIT(8))
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ENA_V  0x1
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ENA_S  8
/* EXTMEM_L1_CACHE_AUTOLOAD_TRIGGER_MODE : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: The field is used to configure trigger mode of autoload operation on L1-Cache. 0
/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger..*/
#define EXTMEM_L1_CACHE_AUTOLOAD_TRIGGER_MODE    0x00000003
#define EXTMEM_L1_CACHE_AUTOLOAD_TRIGGER_MODE_M  ((EXTMEM_L1_CACHE_AUTOLOAD_TRIGGER_MODE_V)<<(EXTMEM_L1_CACHE_AUTOLOAD_TRIGGER_MODE_S))
#define EXTMEM_L1_CACHE_AUTOLOAD_TRIGGER_MODE_V  0x3
#define EXTMEM_L1_CACHE_AUTOLOAD_TRIGGER_MODE_S  3
/* EXTMEM_L1_CACHE_AUTOLOAD_ORDER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: The bit is used to configure the direction of autoload operation on L1-Cache. 0:
 ascending. 1: descending..*/
#define EXTMEM_L1_CACHE_AUTOLOAD_ORDER    (BIT(2))
#define EXTMEM_L1_CACHE_AUTOLOAD_ORDER_M  (BIT(2))
#define EXTMEM_L1_CACHE_AUTOLOAD_ORDER_V  0x1
#define EXTMEM_L1_CACHE_AUTOLOAD_ORDER_S  2
/* EXTMEM_L1_CACHE_AUTOLOAD_DONE : RO ;bitpos:[1] ;default: 1'h1 ; */
/*description: The bit is used to indicate whether autoload operation on L1-Cache is finished o
r not. 0: not finished. 1: finished..*/
#define EXTMEM_L1_CACHE_AUTOLOAD_DONE    (BIT(1))
#define EXTMEM_L1_CACHE_AUTOLOAD_DONE_M  (BIT(1))
#define EXTMEM_L1_CACHE_AUTOLOAD_DONE_V  0x1
#define EXTMEM_L1_CACHE_AUTOLOAD_DONE_S  1
/* EXTMEM_L1_CACHE_AUTOLOAD_ENA : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: The bit is used to enable and disable autoload operation on L1-Cache.  1: enable
, 0: disable..*/
#define EXTMEM_L1_CACHE_AUTOLOAD_ENA    (BIT(0))
#define EXTMEM_L1_CACHE_AUTOLOAD_ENA_M  (BIT(0))
#define EXTMEM_L1_CACHE_AUTOLOAD_ENA_V  0x1
#define EXTMEM_L1_CACHE_AUTOLOAD_ENA_S  0

#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x138)
/* EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the first section
for autoload operation on L1-Cache. Note that it should be used together with L1
_CACHE_AUTOLOAD_SCT0_SIZE and L1_CACHE_AUTOLOAD_SCT0_ENA..*/
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ADDR    0xFFFFFFFF
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ADDR_M  ((EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ADDR_V)<<(EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ADDR_S))
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ADDR_V  0xFFFFFFFF
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_ADDR_S  0

